rtkconnectivity/hal_realtek/bee/drivers/tim/src/rtl8752h/rtl876x_enh_tim.h
/**
*********************************************************************************************************
*               Copyright(c) 2024, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* \file     rtl876x_enh_tim.h
* \brief    The header file of the peripheral Enhance ENHTIMER driver.
* \details  This file provides all Enhance ENHTIMER firmware functions.
* \author   Yuan
* \date     2024-01-17
* \version  v1.0.0
* *********************************************************************************************************
*/

#ifndef _RTL876X_ENH_TIM_H_
#define _RTL876X_ENH_TIM_H_

#ifdef __cplusplus
extern "C" {
#endif


/**
 * \addtogroup  IO          Peripheral Drivers
 * \defgroup    ENHTIM      ENHTIM
 * \brief       Manage the ENHTIM peripheral functions.
 *
 * \ingroup     IO
 */

/*============================================================================*
 *                         Includes
 *============================================================================*/
#include "rtl876x.h"

typedef struct
{
    uint32_t enhtim_reg[17];
} ENHTIMStoreReg_Typedef;

/*============================================================================*
 *                         Constants
 *============================================================================*/

/* ENHTIM private defines */
#define ENHTIM_PWM_DEADZONE_CR  *((volatile uint32_t *)0x40000368UL)
#define ENHTIM_LATCH_COUNT_CR   *((volatile uint32_t *)0x40006028UL)

/**
 * \defgroup    ENHTIM_Exported_Constants  ENHTIM Exported Constants
 *
 * \ingroup     ENHTIM
 */
#define IS_ENHTIM_ALL_PERIPH(PERIPH) (((PERIPH) == ENH_ENHTIM0) || \
                                      ((PERIPH) == ENH_ENHTIM1))

/**
 * \defgroup    ENHTIM_Clock_Source ENHTIM Clock Source
 * \{
 * \ingroup     ENHTIM_Exported_Constants
 */
#define ENHTIM_TIMER_TOGGLE_OUTPUT          ((uint16_t)0x1)
#define ENHTIM_DIVIDER_CLOCK                ((uint16_t)0x0)
/** \} */
#define IS_ENHTIM_CLOCK_SOURCE(src) (((src) == ENHTIM_TIMER_TOGGLE_OUTPUT) || \
                                     ((src) == ENHTIM_DIVIDER_CLOCK))

/**
 * \defgroup    ENHTIM_Latch_En ENHTIM Latch Count Enable
 * \{
 * \ingroup     ENHTIM_Exported_Constants
 */
#define ENHTIM_LATCH_COUNT_ENABLE          ((uint16_t)0x1)
#define ENHTIM_LATCH_COUNT_DISABLE         ((uint16_t)0x0)
/** \} */
#define IS_ENHTIM_LATCH_COUNT_En(mode) (((mode) == ENHTIM_LATCH_COUNT_ENABLE) || \
                                        ((mode) == ENHTIM_LATCH_COUNT_DISABLE))

/**
 * \defgroup    ENHTIM_LATCH_TRIGGER_Mode Latch Count Trigger Mode
 * \{
 * \ingroup     ENHTIM_Exported_Constants
 */
#define ENHTIM_LATCH_TRIGGER_BOTH_EDGE      ((uint16_t)0x02)
#define ENHTIM_LATCH_TRIGGER_FALLING_EDGE   ((uint16_t)0x01)
#define ENHTIM_LATCH_TRIGGER_RISING_EDGE    ((uint16_t)0x00)
/** \} */
#define IS_ENHTIM_LATCH_TRIGGER_Mode(mode) (((mode) == ENHTIM_LATCH_TRIGGER_BOTH_EDGE) || \
                                            ((mode) == ENHTIM_LATCH_TRIGGER_FALLING_EDGE) || \
                                            ((mode) == ENHTIM_LATCH_TRIGGER_RISING_EDGE))

/**
 * \defgroup    ENHTIM_PWM_En ENHTIM PWM Output Enable
 * \{
 * \ingroup     ENHTIM_Exported_Constants
 */
#define ENHTIM_PWM_ENABLE                   ((uint16_t)0x08)
#define ENHTIM_PWM_DISABLE                  ((uint16_t)0x00)
/** \} */
#define IS_ENHTIM_PWM_En(mode) (((mode) == ENHTIM_PWM_ENABLE) || \
                                ((mode) == ENHTIM_PWM_DISABLE))

/**
 * \defgroup    ENHTIM_PWM_Polarity ENHTIM PWM Polarity
 * \{
 * \ingroup     ENHTIM_Exported_Constants
 */
#define ENHTIM_PWM_START_WITH_HIGH          ((uint16_t)0x04)
#define ENHTIM_PWM_START_WITH_LOW           ((uint16_t)0x00)
/** \} */
#define IS_ENHTIM_PWM_POLARITY(pola) (((pola) == ENHTIM_PWM_START_WITH_HIGH) || \
                                      ((pola) == ENHTIM_PWM_START_WITH_LOW))


/**
 * \defgroup    ENHTIM_Mode ENHTIM Mode
 * \{
 * \ingroup     ENHTIM_Exported_Constants
 */
#define ENHTIM_MODE_PWM_MANUAL              ((uint16_t)0x02) /*!< User define pwm manual mode. */
#define ENHTIM_MODE_PWM_AUTO                ((uint16_t)0x01) /*!< User define pwm auto mode. */
#define ENHTIM_MODE_FreeRun                 ((uint16_t)0x00) /*!< User define freerun mode. */
/** \} */
#define IS_ENHTIM_MODE(mode) (((mode) == ENHTIM_MODE_PWM_MANUAL) || \
                              ((mode) == ENHTIM_MODE_PWM_AUTO) || \
                              ((mode) == ENHTIM_MODE_UserDefine))
/**
 * \defgroup    ENHTIM_Interrupts_Definition ENHTIM Interrupts Definition
 * \{
 * \ingroup     ENHTIM_Exported_Constants
 */
#define ENHTIM_INT_TIM                      (0x00)
#define ENHTIM_INT_LATCH_CNT2_FIFO_FULL     (0x40)
#define ENHTIM_INT_LATCH_CNT2_FIFO_THD      (0x42)


/** \} */
#define IS_ENHTIM_INT(INT) (((INT) == ENHTIM_INT_TIM) || \
                            ((INT) == ENHTIM_INT_LATCH_CNT2_FIFO_FULL) || \
                            ((INT) == ENHTIM_INT_LATCH_CNT2_FIFO_THD))


#define ENHTIM_INT_LATCH_CNT2_FIFO_EMPTY    (0x01)

/**
 * \defgroup    ENHTIM_FIFO_Flag ENHTIM FIFO Flag
 * \{
 * \ingroup     ENHTIM_Exported_Constants
 */
#define ENHTIM_FLAG_TIM1_LC_FIFO_EMPTY          BIT(19)
#define ENHTIM_FLAG_TIM0_LC_FIFO_EMPTY          BIT(17)
#define ENHTIM_FLAG_TIM1_CCR_FIFO_EMPTY         BIT(3)
#define ENHTIM_FLAG_TIM1_CCR_FIFO_FULL          BIT(2)
#define ENHTIM_FLAG_TIM0_CCR_FIFO_EMPTY         BIT(1)
#define ENHTIM_FLAG_TIM0_CCR_FIFO_FULL          BIT(0)
/** \} */
#define IS_ENHTIM_CCR_FIFO_FLAG(flag) (((flag) == ENHTIM_FLAG_TIM1_LC_FIFO_EMPTY) || \
                                       ((flag) == ENHTIM_FLAG_TIM0_LC_FIFO_EMPTY) || \
                                       ((flag) == ENHTIM_FLAG_TIM1_CCR_FIFO_EMPTY) || \
                                       ((flag) == ENHTIM_FLAG_TIM1_CCR_FIFO_FULL) || \
                                       ((flag) == ENHTIM_FLAG_TIM0_CCR_FIFO_EMPTY) || \
                                       ((flag) == ENHTIM_FLAG_TIM0_CCR_FIFO_FULL) ))


/**
 * \defgroup    PWM_DeadZone_En PWM DeadZone enable
 * \{
 * \ingroup     ENHTIM_Exported_Constants
 */
#define ENHTIM_PWM_DEADZONE_ENABLE          ((uint16_t)0x1)
#define ENHTIM_PWM_DEADZONE_DISABLE         ((uint16_t)0x0)
/** \} */
#define IS_ENHTIM_PWM_DEADZONE_EN(mode) (((mode) == ENHTIM_PWM_DEADZONE_ENABLE) || \
                                         ((mode) == ENHTIM_PWM_DEADZONE_DISABLE))

/**
 * \defgroup    PWM_DeadZone_En PWM DeadZone enable
 * \{
 * \ingroup     ENHTIM_Exported_Constants
 */
#define ENHTIM_PWM_DZCLKSRCE_ENHTIM         ((uint32_t)0x80000)
#define ENHTIM_PWM_DZCLKSRCE_5M             ((uint32_t)0x10000)
#define ENHTIM_PWM_DZCLKSRCE_32K            ((uint32_t)0x0)
/** \} */
#define IS_ENHTIM_PWM_DEADZONE_EN(mode) (((mode) == ENHTIM_PWM_DEADZONE_ENABLE) || \
                                         ((mode) == ENHTIM_PWM_DEADZONE_DISABLE))

/**
 * \defgroup    ENHTIM_PWM_DeadZone_Stop_State ENHTIM PWM DeadZone Stop State
 * \{
 * \ingroup     ENHTIM_Exported_Constants
 */
#define ENHTIM_PWM_STOP_AT_HIGH             ((uint16_t)0x1)
#define ENHTIM_PWM_STOP_AT_LOW              ((uint16_t)0x0)
/** \} */

/**
 * \defgroup    ENHTIM_FIFO_Clear_Flag ENHTIM FIFO Clear Flag
 * \{
 * \ingroup     ENHTIM_Exported_Constants
 */
#define ENHTIM_FIFO_CLR_CCR                 (0)
#define ENHTIM_FIFO_CLR_CNT2                (24)

