rtkconnectivity/hal_realtek/bee/drivers/tim/src/rtl8752h/rtl876x_enh_tim.h
/** \} */

/**
 * \defgroup    ENHTIM_Clock_Divider ENHTIM Clock Divider
 * \{
 * \ingroup     ENHTIM_Exported_Constants
 */
typedef enum
{
    ENHTIM_CLOCK_DIVIDER_1   = 0x00,
    ENHTIM_CLOCK_DIVIDER_125 = 0x03,
    ENHTIM_CLOCK_DIVIDER_2   = 0x04,
    ENHTIM_CLOCK_DIVIDER_4   = 0x05,
    ENHTIM_CLOCK_DIVIDER_8   = 0x06,
    ENHTIM_CLOCK_DIVIDER_40  = 0x07,
} E_ENHTIM_CLKDIV;

/** \} */

/**
 * \defgroup    ENHTIM_Latch_Counter ENHTIM Latch Counter
 * \{
 * \ingroup     ENHTIM_Exported_Constants
 */
typedef enum
{
    LATCH_CNT_0 = 0,
    LATCH_CNT_1 = 1,
    LATCH_CNT_2 = 2,
} E_ENHTIM_LATCHCNT;

/** \} */

/** End of ENHTIM_Exported_Constants
  * \}
  */

/*============================================================================*
 *                         Types
 *============================================================================*/
/**
 * \defgroup    ENHTIM_Exported_Types ENHTIM Exported Types
 * \{
 * \ingroup     ENHTIM
 */

/**
 * \brief       ENHTIM init structure definition
 *
 * \ingroup     ENHTIM_Exported_Types
 */
typedef struct
{
    uint16_t ENHTIM_ClockSource;            /*!< <b>Deprecated</b> use RCC instead.*/
    E_ENHTIM_CLKDIV ENHTIM_ClockDiv;        /*!< Specifies the clock source div.
                                                 This parameter can be a value of \ref ENHTIM_Clock_Divider*/
    uint16_t ENHTIM_Mode;                   /*!< Specifies the counter mode.
                                                 This parameter can be a value of \ref ENHTIM_Mode. */
    uint16_t ENHTIM_PWMOutputEn;            /*!< Specifies the PWM mode.
                                                 This parameter can be a value of DISABLE or ENABLE */
    uint16_t ENHTIM_PWMStartPolarity;       /*!< Specifies the PWM mode.
                                                  This parameter can be a value of DISABLE or ENABLE */
    uint16_t ENHTIM_LatchCountEn[3];        /*!< Specifies enbale EnhtimerN Latch_cnt.
                                                 This parameter can be a value of DISABLE or ENABLE */
    uint16_t ENHTIM_LatchCountTrigger[3];   /*!< Specifies EnhtimerN counter latch trigger mode.
                                                 This parameter can be a value of DISABLE or ENABLE */
    uint16_t ENHTIM_LatchCount2Thd;         /*!< Specifies EnhtimerN latched counter fifo threshold.
                                                 This parameter can be a value of DISABLE or ENABLE */
    uint16_t ENHTIM_LatchTriggerPad;        /*!< Specifies the PWM mode.
                                                 This parameter can be a value of DISABLE or ENABLE */
    uint16_t ENHTIM_TimerGPIOTriggerEn;         /*!< Specifies the PWM mode.
                                                 This parameter can be a value of DISABLE or ENABLE */
    uint16_t ENHTIM_BTGPIOTriggerEn;        /*!< Specifies the PWM mode.
                                                 This parameter can be a value of DISABLE or ENABLE */
    uint32_t ENHTIM_MaxCount;               /*!< Specifies the Enhtimer max counter value for user-define PWM mode.
                                                 This parameter leagel value range is from 0 ~ 2^32-2. */
    uint32_t ENHTIM_CCValue;                /*!< Specifies the Enhtimer capture/compare value for user-define PWM mode.*/
    uint16_t ENHTIM_PWMDeadZoneEn;          /*!<PWM Deadzone enable, pwm0_pn: timer2, pwm1_pn:timer3
                                                 This parameter can be a value of ENABLE or DISABLE. */
    uint32_t ENHTIM_PWMDeadZoneClockSource; /*!< Specifies ENHTIM Source depend.timer3 depend timer2 ,timer5 depend timer4, timer7 depend timer6.
                                                 This parameter can be a value of ENABLE or DISABLE */
    uint16_t ENHTIM_PWMStopStateP;          /*!< Specifies the PWM P stop state.
                                                 This parameter can be a value of \ref PWMDeadZone_Stop_state. */
    uint16_t ENHTIM_PWMStopStateN;          /*!< Specifies the PWM N stop state.
                                                 This parameter can be a value of \ref PWMDeadZone_Stop_state. */
    uint32_t ENHTIM_DeadZoneSize;           /*!<Size of deadzone time, DeadzoneTime=deadzonesize/32000 or 32768.
                                                 This parameter must range from 1 to 0xffffffff. */
} ENHTIM_InitTypeDef;

/** End of ENHTIM_Exported_Types
  * \}
  */

/*============================================================================*
 *                         Functions
 *============================================================================*/
/**
 * \defgroup    ENHTIM_Exported_Functions  ENHTIM Exported Functions
 * \{
 * \ingroup     ENHTIM
 */

/**
 * \brief     Initialize the ENHTIMx unit peripheral according to
 *            the specified parameters in ENHTIM_InitStruct.
 * \param[in] ENHTIMx: Where x can be 0 to 1 to select the ENHTIM peripheral.
 * \param[in] ENHTIM_InitStruct: pointer to a ENHTIM_InitTypeDef structure
  *           that contains the configuration information for the specified ENHTIM peripheral.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_enhance_timer_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_TIMER, APBPeriph_TIMER_CLOCK, ENABLE);
 *
 *     ENHTIM_InitTypeDef ENHTIM_InitStruct;
 *     ENHTIM_StructInit(&ENHTIM_InitStruct);
 *
 *     ENHTIM_InitStruct.ENHTIM_PWM_En = PWM_DISABLE;
 *     ENHTIM_InitStruct.ENHTIM_Period = 1000000 - 1 ;
 *     ENHTIM_InitStruct.ENHTIM_Mode = ENHTIM_Mode_UserDefine;
 *     ENHTIM_Init(ENHTIMER_NUM, &ENHTIM_InitStruct);
 * }
 * \endcode
 */
void ENHTIM_Init(ENHTIM_TypeDef *ENHTIMx, ENHTIM_InitTypeDef *ENHTIM_TimeBaseInitStruct);

/**
 * \brief   Fills each ENHTIM_InitStruct member with its default value.
 * \param[in] ENHTIM_TimeBaseInitStruct: Pointer to a ENHTIM_TimeBaseInitTypeDef structure which will be initialized.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_enhance_timer_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_ENHTIMER, APBPeriph_ENHTIMER_CLOCK, ENABLE);
 *
 *     ENHTIM_TimeBaseInitTypeDef ENHTIM_InitStruct;
 *     ENHTIM_StructInit(&ENHTIM_InitStruct);
 *
 *     ENHTIM_InitStruct.ENHTIM_PWM_En = PWM_DISABLE;
 *     ENHTIM_InitStruct.ENHTIM_Period = 1000000 - 1;
 *     ENHTIM_InitStruct.ENHTIM_Mode = ENHTIM_Mode_UserDefine;
 *     ENHTIM_TimeBaseInit(ENH_TIM0, &ENHTIM_InitStruct);
 * }
 * \endcode
 */
void ENHTIM_StructInit(ENHTIM_InitTypeDef *ENHTIM_InitStruct);

/**
 * \brief     Enables or disables the specified ENHTIM peripheral.
 * \param[in] ENHTIMx: Where x can be 0 to 1 to select the ENHTIMx peripheral.
 * \param[in] NewState: New state of the ENHTIMx peripheral.
 *            This parameter can be: ENABLE or DISABLE.
 * \return    None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_enhance_timer_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_ENHTIMER, APBPeriph_ENHTIMER_CLOCK, ENABLE);
 *
 *     ENHTIM_InitTypeDef ENHTIM_InitStruct;
 *     ENHTIM_StructInit(&ENHTIM_InitStruct);
 *
 *     ENHTIM_InitStruct.ENHTIM_PWM_En = PWM_DISABLE;
 *     ENHTIM_InitStruct.ENHTIM_Period = 1000000 - 1;
 *     ENHTIM_InitStruct.ENHTIM_Mode = ENHTIM_Mode_UserDefine;
 *     ENHTIM_Init(ENH_TIM0, &ENHTIM_InitStruct);
 *     ENHTIM_Cmd(ENH_TIM0, ENABLE);
 * }
 * \endcode
 */
void ENHTIM_Cmd(ENHTIM_TypeDef *ENHTIMx, FunctionalState NewState);

/**
  * \brief     Mask or unmask the latch count2 fifo interrupt.
  * \param[in] ENHTIMx: Where x can be 0 to 1 to select the ENHTIMx peripheral.
  * \param[in] NewState: New state of the specified ENHTIMx peripheral latch count2 fifo interrupt.
  *            This parameter can be: ENABLE or DISABLE.
  * \retval None.
  */
void ENHTIM_LCFIFOMaskConfig(ENHTIM_TypeDef *ENHTIMx, FunctionalState NewState);

/**
 * \brief     Enables or disables ENHTIMx interrupt.
 * \param[in] ENHTIMx: Where x can be 0 to 1 to select the ENHTIMx peripheral.
 * \param[in] ENHTIM_INT: Specifies the ENHTIMx interrupt source which to be enabled or disabled.
 *            This parameter can be one of the following values:
 *            \arg ENHTIM_INT_TIM: Enhance Timer interrupt source.
 *            \arg ENHTIM_INT_LATCH_CNT2_FIFO_FULL: Enhance Timer latch count2 fifo full interrupt source.
 *            \arg ENHTIM_INT_LATCH_CNT2_FIFO_EMPTY: Enhance Timer latch count2 fifo empty interrupt source.
 *            \arg ENHTIM_INT_LATCH_CNT2_FIFO_THD: Enhance Timer latch count2 fifo threshold interrupt source.
 * \param[in] NewState: New state of the ENHTIMx peripheral.
 *            This parameter can be: ENABLE or DISABLE.
 * \return    None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_enhance_timer_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_TIMER, APBPeriph_TIMER_CLOCK, ENABLE);
 *
 *     ENHTIM_InitTypeDef ENHTIM_InitStruct;
 *     ENHTIM_StructInit(&ENHTIM_InitStruct);
 *
 *     ENHTIM_InitStruct.ENHTIM_PWM_En = PWM_DISABLE;
 *     ENHTIM_InitStruct.ENHTIM_Period = 1000000 - 1;
 *     ENHTIM_InitStruct.ENHTIM_Mode = ENHTIM_Mode_UserDefine;
 *     ENHTIM_Init(ENH_TIM0, &ENHTIM_InitStruct);
 *     ENHTIM_ClearINT(ENH_TIM0);
 *     ENHTIM_INTConfig(ENH_TIM0, ENABLE);
 */
void ENHTIM_INTConfig(ENHTIM_TypeDef *ENHTIMx, uint8_t ENHTIM_INT, FunctionalState NewState);

/**
 * \brief     Read ENHTIMx latch counter2 fifo data.
 * \param[in] ENHTIMx: Where x can be 0 to 1 to select the ENHTIMx peripheral.
 * \param[in] length: Latch count2 fifo length, max 4.
 * \pBuf[out] pBuf: FIFO data out buffer.
 * \return    None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void enhance_timer_demo(void)
 * {
 *     uint8_t length = ENHTIM_GetLatchCount2FIFOLength(ENH_TIM0);
 * }
 * \endcode
 */
void ENHTIM_ReadLatchCount2FIFO(ENHTIM_TypeDef *ENHTIMx, uint32_t *pBuf, uint8_t length);

/**
 * \brief     Check whether the ENHTIM interrupt has occurred or not.
 * \param[in] ENHTIMx: Where x can be 0 to 1 to select the ENHTIMx peripheral.
 * \return    The new state of the specified ENHTIMx peripheral
 *            latch count2 fifo interrupt(SET or RESET).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void enhance_timer_demo(void)
 * {
 *     ITStatus int_status = ENHTIM_GetLCMaskINTStatus(ENH_TIM0);
 * }
 * \endcode
 */
ITStatus ENHTIM_GetLCFIFOMaskStatus(ENHTIM_TypeDef *ENHTIMx);

/**
 * \brief     Check whether the ENHTIM interrupt has occurred or not.
 * \param[in] ENHTIMx: Where x can be 0 to 1 to select the ENHTIMx peripheral.
 * \param[in] ENHTIM_INT: Specifies the ENHTIMx interrupt source which to be enabled or disabled.
 *            This parameter can be one of the following values:
 *            \arg ENHTIM_INT_TIM: Enhance Timer interrupt source.
 *            \arg ENHTIM_INT_LATCH_CNT2_FIFO_FULL: Enhance Timer latch count2 fifo full interrupt source.
 *            \arg ENHTIM_INT_LATCH_CNT2_FIFO_EMPTY: Enhance Timer latch count2 fifo empty interrupt source.
 *            \arg ENHTIM_INT_LATCH_CNT2_FIFO_THD: Enhance Timer latch count2 fifo threshold interrupt source.
 * \return    The new state of the ENHTIM_INT(SET or RESET).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void enhance_timer_demo(void)
 * {
 *     ENHTIM_GetINTStatus(ENH_TIM0, ENHTIM_INT_TIM);
 * }
 * \endcode
 */
ITStatus ENHTIM_GetINTStatus(ENHTIM_TypeDef *ENHTIMx, uint8_t ENHTIM_INT);

/**
 * \brief     Clear ENHTIMx interrupt.
 * \param[in] ENHTIMx: Where x can be 0 to 1 to select the ENHTIMx peripheral.
 * \param[in] ENHTIM_INT: Specifies the ENHTIMx interrupt source which to be enabled or disabled.
 *            This parameter can be one of the following values:
 *            \arg ENHTIM_INT_TIM: Enhance Timer interrupt source.
 *            \arg ENHTIM_INT_LATCH_CNT2_FIFO_FULL: Enhance Timer latch count2 fifo full interrupt source.
 *            \arg ENHTIM_INT_LATCH_CNT2_FIFO_THD: Enhance Timer latch count2 fifo threshold interrupt source.
 * \return    None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void enhance_timer_demo(void)
 * {
 *     ENHTIM_ClearINTPendingBit(ENH_TIM0, ENHTIM_INT_TIM);
 * }
 * \endcode
 */
void ENHTIM_ClearINTPendingBit(ENHTIM_TypeDef *ENHTIMx, uint8_t ENHTIM_INT);

/**
 * \brief     Get ENHTIMx current value when timer is running.
 * \param[in] ENHTIMx: where x can be 0 to 1 to select the ENHTIMx peripheral.
 * \return    The counter value.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void enhance_timer_demo(void)
 * {
 *     uint32_t cur_value = ENHTIM_GetCurrentValue(ENH_TIM0);
 * }
 * \endcode
 */
__STATIC_INLINE uint32_t ENHTIM_GetCurrentCount(ENHTIM_TypeDef *ENHTIMx)
{
    /* Check the parameters */
    assert_param(IS_ENHTIM_ALL_PERIPH(ENHTIMx));

    return ENHTIMx->CUR_CNT;
}

/**
 * \brief     Set Max Count value.
 * \param[in] ENHTIMx: Where x can be 0 to 1 to select the ENHTIMx peripheral.
 * \param[in] count: .
 * \return    None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void enhance_timer_demo(void)
 * {
 *     ENHTIM_SetMaxCount(ENH_TIM0, 0x10000);
 * }
 * \endcode
 */
__STATIC_INLINE void ENHTIM_SetMaxCount(ENHTIM_TypeDef *ENHTIMx, uint32_t count)
{
    /* Check the parameters */
    assert_param(IS_ENHTIM_ALL_PERIPH(ENHTIMx));

