rtkconnectivity/hal_realtek/bee/drivers/tim/src/rtl8752h/rtl876x_enh_tim.h
    ENHTIMx->MAX_CNT = count & 0xFFFFFFFE;
}

/**
 * \brief     Set ENHTIMx capture/compare value for user-define PWM manual mode.
 * \param[in] ENHTIMx: Where x can be 0 to 1 to select the ENHTIMx peripheral.
 * \param[in] value: .
 * \return    None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void enhance_timer_demo(void)
 * {
 *     ENHTIM_SetCCValue(ENH_TIM0, 0x1000);
 * }
 * \endcode
 */
__STATIC_INLINE void ENHTIM_SetCCValue(ENHTIM_TypeDef *ENHTIMx, uint32_t value)
{
    /* Check the parameters */
    assert_param(IS_ENHTIM_ALL_PERIPH(ENHTIMx));

    ENHTIMx->CCR = value;
}

/**
 * \brief     Set ENHTIMx capture/compare value for user-define PWM auto mode.
 * \param[in] ENHTIMx: Where x can be 0 to 1 to select the ENHTIMx peripheral.
 * \param[in] value: .
 * \return    None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void enhance_timer_demo(void)
 * {
 *     ENHTIM_WriteCCFIFO(ENH_TIM0,0x10000);
 * }
 * \endcode
 */
__STATIC_INLINE void ENHTIM_WriteCCFIFO(ENHTIM_TypeDef *ENHTIMx, uint32_t value)
{
    /* Check the parameters */
    assert_param(IS_ENHTIM_ALL_PERIPH(ENHTIMx));

    ENHTIMx->CCR_FIFO = value;
}

///**
// * \brief     Check whether the specified ENHTIM CCR FIFO flag is set.
// * \param[in] ENHTIM_FLAG: Specifies the flag to check.
// *            This parameter can be one of the following values:
// *            \arg ENHTIM_FLAG_TIM1_LC_FIFO_EMPTY: FIFO empty or not. If SET, CCR FIFO is empty.
// *            \arg ENHTIM_FLAG_TIM0_LC_FIFO_EMPTY: FIFO full or not. If SET, CCR FIFO is full.
// * \return    The new state of ENHTIM_FLAG (SET or RESET).
// *
// * <b>Example usage</b>
// * \code{.c}
// *
// * void enhance_timer_demo(void)
// * {
// *     FlagStatus flag_status = ENHTIM_GetCCRFIFOFlagStatus(ENHTIM_FLAG_FIFO_EMPTY);
// * }
// * \endcode
// */
//__STATIC_INLINE FlagStatus ENHTIM_GetLCFIFOFlagStatus(uint32_t ENHTIM_FLAG)
//{
//    /* Check the parameters */
//    assert_param(IS_ENHTIM_LC_FIFO_FLAG(ENHTIM_FLAG));

//    FlagStatus bitstatus = RESET;

//  if (ENH_TIM_SHARE->FIFO_SR2 & ENHTIM_FLAG)
//  {
//      bitstatus = SET;
//  }

//  return bitstatus;
//}

///**
// * \brief     Check whether the specified ENHTIM CCR FIFO flag is set.
// * \param[in] ENHTIM_FLAG: Specifies the flag to check.
// *            This parameter can be one of the following values:
// *            \arg ENHTIM_FLAG_TIM1_CCR_FIFO_EMPTY: FIFO empty or not. If SET, CCR FIFO is empty.
// *            \arg ENHTIM_FLAG_TIM1_CCR_FIFO_FULL: FIFO full or not. If SET, CCR FIFO is full.
// *            \arg ENHTIM_FLAG_TIM0_CCR_FIFO_EMPTY: FIFO empty or not. If SET, CCR FIFO is empty.
// *            \arg ENHTIM_FLAG_TIM0_CCR_FIFO_FULL: FIFO full or not. If SET, CCR FIFO is full.
// * \return    The new state of ENHTIM_FLAG (SET or RESET).
// *
// * <b>Example usage</b>
// * \code{.c}
// *
// * void enhance_timer_demo(void)
// * {
// *     FlagStatus flag_status = ENHTIM_GetCCRFIFOFlagStatus(ENHTIM_FLAG_FIFO_EMPTY);
// * }
// * \endcode
// */
//__STATIC_INLINE FlagStatus ENHTIM_GetCCRFIFOFlagStatus(uint32_t ENHTIM_FLAG)
//{
//    /* Check the parameters */
//    assert_param(IS_ENHTIM_CCR_FIFO_FLAG(ENHTIM_FLAG));

//    FlagStatus bitstatus = RESET;

//  if (ENH_TIM_SHARE->FIFO_SR2 & ENHTIM_FLAG)
//  {
//      bitstatus = SET;
//  }

//  return bitstatus;
//}

/**
 * \brief     Check whether the specified ENHTIM CCR FIFO flag is set.
 * \param[in] ENHTIM_FLAG: Specifies the flag to check.
 *            This parameter can be one of the following values:
 *            \arg ENHTIM_FLAG_TIM1_LC_FIFO_EMPTY: FIFO empty or not. If SET, CCR FIFO is empty.
 *            \arg ENHTIM_FLAG_TIM0_LC_FIFO_EMPTY: FIFO full or not. If SET, CCR FIFO is full.
 *            \arg ENHTIM_FLAG_TIM1_CCR_FIFO_EMPTY: FIFO empty or not. If SET, CCR FIFO is empty.
 *            \arg ENHTIM_FLAG_TIM1_CCR_FIFO_FULL: FIFO full or not. If SET, CCR FIFO is full.
 *            \arg ENHTIM_FLAG_TIM0_CCR_FIFO_EMPTY: FIFO empty or not. If SET, CCR FIFO is empty.
 *            \arg ENHTIM_FLAG_TIM0_CCR_FIFO_FULL: FIFO full or not. If SET, CCR FIFO is full.
 * \return    The new state of ENHTIM_FLAG (SET or RESET).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void enhance_timer_demo(void)
 * {
 *     FlagStatus flag_status = ENHTIM_GetCCRFIFOFlagStatus(ENHTIM_FLAG_FIFO_EMPTY);
 * }
 * \endcode
 */
__STATIC_INLINE FlagStatus ENHTIM_GetFIFOFlagStatus(uint32_t ENHTIM_FLAG)
{
    /* Check the parameters */
    assert_param(IS_ENHTIM_FIFO_FLAG(ENHTIM_FLAG));

    FlagStatus bitstatus = RESET;

    if (ENH_TIM_SHARE->FIFO_SR2 & ENHTIM_FLAG)
    {
        bitstatus = SET;
    }

    return bitstatus;
}

/**
 * \brief     Enable ENHTIMx latch counter.
 * \param[in] ENHTIMx: where x can be 0 to 1 to select the ENHTIMx peripheral.
 * \param[in] LatchCntIdx: E_ENHTIM_LATCHCNT enum value.
 *            This parameter can be one of follow.
 *            \arg LATCH_COUNT_0: Enhance timer latch count 0.
 *            \arg LATCH_COUNT_1: Enhance timer latch count 1.
 *            \arg LATCH_COUNT_2: Enhance timer latch count 2.
 * \return    None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void enhance_timer_demo(void)
 * {
 *     uint32_t cur_value = ENHTIM_LatchCountEnable(ENH_TIM0, LATCH_COUNT_2);
 * }
 * \endcode
 */
__STATIC_INLINE void ENHTIM_LatchCountEnable(ENHTIM_TypeDef *ENHTIMx, E_ENHTIM_LATCHCNT LatchCntIdx)
{
    /* Check the parameters */
    assert_param(IS_ENHTIM_ALL_PERIPH(ENHTIMx));

    ENHTIMx->CR |= BIT(LatchCntIdx + 10);
}

/**
 * \brief     Disable ENHTIMx latch counter.
 * \param[in] ENHTIMx: where x can be 0 to 1 to select the ENHTIMx peripheral.
 * \param[in] LatchCntIdx: E_ENHTIM_LATCHCNT enum value.
 *            This parameter can be one of follow.
 *            \arg LATCH_COUNT_0: Enhance timer latch count 0.
 *            \arg LATCH_COUNT_1: Enhance timer latch count 1.
 *            \arg LATCH_COUNT_2: Enhance timer latch count 2.
 * \return    None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void enhance_timer_demo(void)
 * {
 *     uint32_t cur_value = ENHTIM_LatchCountDisable(ENH_TIM0, LATCH_COUNT_2);
 * }
 * \endcode
 */
__STATIC_INLINE void ENHTIM_LatchCountDisable(ENHTIM_TypeDef *ENHTIMx,
                                              E_ENHTIM_LATCHCNT LatchCntIdx)
{
    /* Check the parameters */
    assert_param(IS_ENHTIM_ALL_PERIPH(ENHTIMx));

    ENHTIMx->CR &= ~BIT(LatchCntIdx + 10);
}

/**
 * \brief     Get ENHTIMx latch count value.
 * \param[in] ENHTIMx: Where x can be 0 to 1 to select the ENHTIMx peripheral.
 * \param[in] LatchCntIdx: E_ENHTIM_LATCHCNT enum value.
 *            This parameter can be one of follow.
 *            \arg LATCH_COUNT_0: Enhance timer latch count 0.
 *            \arg LATCH_COUNT_1: Enhance timer latch count 1.
 *            \arg LATCH_COUNT_2: Enhance timer latch count 2.
 * \return    The latch counter value.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void enhance_timer_demo(void)
 * {
 *     uint32_t count_value = ENHTIM_GetLatchCountValue(ENH_TIM0, LATCH_COUNT_0);
 * }
 * \endcode
 */
__STATIC_INLINE uint32_t ENHTIM_GetLatchCount(ENHTIM_TypeDef *ENHTIMx,
                                              E_ENHTIM_LATCHCNT LatchCntIdx)
{
    /* Check the parameters */
    assert_param(IS_ENHTIM_ALL_PERIPH(ENHTIMx));

    uint32_t count = 0;
    count = *(volatile uint32_t *)(&(ENHTIMx->LATCH_CNT0) + LatchCntIdx);
    return count;
}

/**
 * \brief     Get ENHTIMx latch counter2 fifo length.
 * \param[in] ENHTIMx: where x can be 0 to 1 to select the ENHTIMx peripheral.
 * \return    FIFO data length.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void enhance_timer_demo(void)
 * {
 *     uint8_t length = ENHTIM_GetLatchCount2FIFOLength(ENH_TIM0);
 * }
 * \endcode
 */
__STATIC_INLINE uint8_t ENHTIM_GetLatchCount2FIFOLength(ENHTIM_TypeDef *ENHTIMx)
{
    /* Check the parameters */
    assert_param(IS_ENHTIM_ALL_PERIPH(ENHTIMx));

    uint32_t enhtim_id = ((uint32_t)ENHTIMx - (uint32_t)ENH_TIM0) / 0X24;

    return (uint8_t)(((*((volatile uint32_t *)(&(ENH_TIM_SHARE->LC_FIFO_LEVEL0) + enhtim_id))) >> 16) &
                     0x1F);
}

/**
 * \brief     Clear capture/compare or latch count2 fifo.
 * \param[in] ENHTIMx: Where x can be 0 to 1 to select the ENHTIMx peripheral.
 * \param[in] FIFO_CLR: Specifies the FIFO type which to be clear.
 *            This parameter can be one of the following values:
 *            \arg ENHTIM_FIFO_CLR_CCR: Enhance Timer CCR FIFO clear flag.
 *            \arg ENHTIM_FIFO_CLR_CNT2: Enhance Timer latch count2 FIFO clear flag.
 * \return    None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void enhance_timer_demo(void)
 * {
 *     ENHTIM_ClearFIFO(ENH_TIM0, ENHTIM_FIFO_CLR_CCR);
 * }
 * \endcode
 */
__STATIC_INLINE void ENHTIM_ClearFIFO(ENHTIM_TypeDef *ENHTIMx, uint8_t FIFO_CLR)
{
    /* Check the parameters */
    assert_param(IS_ENHTIM_ALL_PERIPH(ENHTIMx));

    uint32_t enhtim_id = ((uint32_t)ENHTIMx - (uint32_t)ENH_TIM0) / 0X24;

    ENH_TIM_SHARE->FIFO_CLR |= (BIT(FIFO_CLR + enhtim_id));
}

/**
 * \brief   ENHTIM PWM complementary output emergency stop.
 * \param   None.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void enhance_timer_demo(void)
 * {
 *     ENHTIM_PWMDeadZoneEMStop();
 * }
 * \endcode
 */
__STATIC_INLINE void ENHTIM_PWMDeadZoneEMStop(void)
{
    ENHTIM_PWM_DEADZONE_CR |= BIT(8);
}

/**
 * \brief     Get ENHTIM PWM output status.
 * \param[in] ENHTIMx: Where x can be 0 to 1 to select the ENHTIMx peripheral.
 * \return    ENHTIM PWM output status(SET or RESET).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void enhance_timer_demo(void)
 * {
 *     FlagStatus status = ENHTIM_GetPWMOutputState(ENH_TIM0);
 * }
 * \endcode
 */
__STATIC_INLINE FlagStatus ENHTIM_GetPWMOutputState(ENHTIM_TypeDef *ENHTIMx)
{
    /* Check the parameters */
    assert_param(IS_ENHTIM_ALL_PERIPH(ENHTIMx));

    uint32_t enhtim_id = ((uint32_t)ENHTIMx - (uint32_t)ENH_TIM0) / 0X24;
    uint32_t status = ENHTIM_LATCH_COUNT_CR & (0x1 << (enhtim_id + 6));
    return (FlagStatus)(status >> (enhtim_id + 6));
}

///**
// * \brief     Check whether the ENHTIM interrupt has occurred or not.
// * \param[in] ENHTIMx: Where x can be 0 to 1 to select the ENHTIMx peripheral.
// * \return    The new state of the ENHTIM_IT(SET or RESET).
// *
// * <b>Example usage</b>
// * \code{.c}
// *
// * void enhance_timer_demo(void)
// * {
// *     ITStatus int_status = ENHTIM_GetINTStatus(ENH_TIM0);
// * }
// * \endcode
// */
//__STATIC_INLINE uint32_t ENHTIM_GetAllINTStatus(void)
//{
//    return ENH_TIM_SHARE->MASK_INT_SR;
//}

/**
 * \brief   Enable or disable bypass dead zone function of PWM complementary output.
 *          After enabling, PWM_P = ~PWM_N.
 * \param[in] ENHTIMx: ENHTIM0.
 * \param[in] NewState: New state of the ENHTIMx peripheral.
 *      \ref DISABLE: Disable bypass dead zone function.
 *      \ref ENABLE: Enable bypass dead zone function.
 * \note    To use this function, need to configure the corresponding enhtimer.
 *          ENHTIMx can be only ENHTIM0.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_pwm_init(void)
 * {
 *     ENHTIM_PWMDZBypassCmd(ENHTIM0, ENABLE);
 * }
 * \endcode
 */
void ENHTIM_PWMDZBypassCmd(ENHTIM_TypeDef *ENHTIMx, FunctionalState NewState);

/** End of ENHTIM_Exported_Functions
  * \}
  */

/** End of ENHTIM
  * \}
  */

#ifdef __cplusplus
}
#endif

#endif /*_RTL876X_ENH_TIM_H_*/


/******************* (C) COPYRIGHT 2020 Realtek Semiconductor Corporation *****END OF FILE****/
